# $Id$
# Based on aboutbox.properties 1.11
# Copyright (c) 2006 The Regents of the University of California. All
# Rights Reserved. Permission to use, copy, modify, and distribute this
# software and its documentation without fee, and without a written
# agreement is hereby granted, provided that the above copyright notice
# and this paragraph appear in all copies.  This software program and
# documentation are copyrighted by The Regents of the University of
# California. The software program and documentation are supplied "AS
# IS", without any accompanying services from The Regents. The Regents
# does not warrant that the operation of the program will be
# uninterrupted or error-free. The end-user understands that the program
# was developed for research purposes and is advised not to rely
# exclusively on the program for any reason.  IN NO EVENT SHALL THE
# UNIVERSITY OF CALIFORNIA BE LIABLE TO ANY PARTY FOR DIRECT, INDIRECT,
# SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS,
# ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF
# THE UNIVERSITY OF CALIFORNIA HAS BEEN ADVISED OF THE POSSIBILITY OF
# SUCH DAMAGE. THE UNIVERSITY OF CALIFORNIA SPECIFICALLY DISCLAIMS ANY
# WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
# MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE SOFTWARE
# PROVIDED HEREUNDER IS ON AN "AS IS" BASIS, AND THE UNIVERSITY OF
# CALIFORNIA HAS NO OBLIGATIONS TO PROVIDE MAINTENANCE, SUPPORT,
# UPDATES, ENHANCEMENTS, OR MODIFICATIONS.
#
# Keys in alphabetic order. 
# Don't sort the lines! That will probably make a mess since they values
# span several lines.
#
aboutbox.aboutbox-title = Despre ArgoUML

aboutbox.bugreport = \
	Cum puteti raporta erori.\n\
	\n\
	Ca \u00een cazul multor alte aplica\u0163ii, exist\u0103 c\u00e2teva \
	erori \u015fi \u00een ArgoUML. Aceste erori se pot manifesta \
	printr-o comportare ciudat\u0103 a programului, opera\u0163ii al c\u0103ror \
	rezultat nu este cel a\u015fteptat, etc.. O parte din aceste erori \
	au fost gasite, altele nu. \n\
	\n\
	Pentru a v\u0103 asigura c\u0103 erorile pe care le \u00eent\u00e2lni\u0163i \
	sunt cunoscute celor care lucreaz\u0103 la dezvolarea programului: \n\
	\n\
	1.  Vizita\u0163i site-ul web al proiectului: http://argouml.tigris.org.\n\
	\n\
	2.  \u00cenregistra\u0163i-v\u0103 ca membru Tigris (\u00een cazul \u00een \
	care nu sunte\u0163i deja \u00eenregistrat).\n\
	\n\
	3.  Cere\u0163i rolul de Observator pentru proiect \
	    (\u00een cazul \u00een care nu a\u0163i f\u0103cut asta deja).\n\
	\n\
	4.  Vizita\u0163i Issuezilla (Bugs and Issues).\n\
	\n\
	5.  Verifica\u0163i dac\u0103 eroarea nu este deja \u00een baza de date.\n\
	\n\
	6.  \u00cen cazul \u00een care se dovede\u015fte c\u0103 eroarea este \
	\u00eenregistrat\u0103 deja \u00een baza de date, ad\u0103uga\u0163i eventualele \
	observa\u0163ii pe care le ave\u0163i de f\u0103cut, ad\u0103uga\u0163i-v\u0103 \
	la lista CC pentru intrarea respectiv\u0103 (Issue) \u015fi a\u0163i terminat.  \
	\u00cen cazul \u00een care nu g\u0103si\u0163i eroarea, crea\u0163i o \
	nou\u0103 intrare.\n\
	\n\
	7.  Atunci c\u00e2nd crea\u0163i o intrare nou\u0103 sau \
	    ad\u0103uga\u0163i informa\u0163ii uneia existente, asigura\u0163i-v\u0103 \
	    c\u0103 include\u0163i urm\u0103toarele: \n\
	-+- versiunea aplica\u0163iei pe care o folosi\u0163i,\n\
	-+- versiunea jdk sau jre pe care o folosi\u0163i,\n\
	-+- to\u0163i pa\u015fii "relevan\u0163i" care trebuie urma\u0163i pentru a \
	reproduce eroarea, \n\
	-+- test case-urile pe care le-a\u0163i rulat (dac\u0103 este cazul),\n\
	-+- care este rezultatul pe care \u00eel a\u015ftepta\u0163i la rularea \
	test case-urilor,\n\
	-+- care a fost rezultatul efectiv ob\u0163inut,\n\
	-+- care este dup\u0103 p\u0103rerea dumneavoastr\u0103 problema.\n\
	\n\
	8.  \u00cen cazul \u00een care problema poate fi reprodus\u0103, \
	rula\u0163i din nou aplica\u0163ia cu op\u0163iunea de \u00eenregistrare \
	a informa\u0163iilor de depanare \u00een registru activat\u0103 \
	(java -Dlog4j.configuration=org/argouml/resource/full.lcf \
	-jar argouml.jar) \
	\u015fi ad\u0103uga\u0163i fi\u015fierul argo_full.log la intrare.\n\
	\n\
	9.  Ad\u0103uga\u0163i (sub form\u0103 de ata\u015fament) informa\u0163iile \
	suplimentare care poate fi relevante pentru problem\u0103. \
	Aceste informa\u0163ii pot fi: capturi de ecran, fi\u015fiere cu proiecte, \
	alte registre cu informa\u0163ii de depanare, etc..\n\
	Nu uita\u0163i c\u0103 ArgoUML este un proiect foarte deschis (informa\u0163iile, \
	cuprinse \u00een \u00eenregistr\u0103rile de raportare a erorilor, au caracter \
	public), de aceea ave\u0163i grij\u0103 \
	ca, atunci c\u00e2nd raporta\u0163i o eroare, s\u0103 nu include\u0163i \u00een \
	\u00eenregistrarea referitoare la eroare informa\u0163ii care constituie \
	secrete comerciale sau alte informa\u0163ii sensibile.\n\
	\n\
	10. Ve\u0163i primi o notificare, prin email, atunci c\u00e2nd \
	sunt ad\u0103ugate comentarii la \u00eenregistrare sau c\u00e2nd cineva \
	aduce modific\u0103ri \u00eenregistr\u0103rii.\n\
	\n\
	11. C\u00e2nd problema, la care se face referire \u00een \u00eenregistrarea \
	pe care a\u0163i creat-o sau pe care a\u0163i \u00eent\u00e2lnit-o \u00een baza de date, \
	a fost rezolvat\u0103 \u015fi verificat\u0103, \u00eenchide\u0163i \u00eenregistrarea \
	dup\u0103 ce a\u0163i acceptat solu\u0163ia.\n\
	\n\
	Urm\u00e2nd pa\u015fii prezenta\u0163i anterior, \
	aduce\u0163i o contribu\u0163ie important\u0103 proiectului ArgoUML. \
	Ajutorul dumneavoastr\u0103 face posibil ca ArgoUML s\u0103 devin\u0103 \
	un produs mai bun. \
	Dac\u0103 dori\u0163i s\u0103 ajuta\u0163i \u015fi mai mult proiectul ArgoUML \
	prin investigarea \u015fi repararea erorilor, sunte\u0163i binevenit. \
	Pute\u0163i \u00eencepe prin a citi primul capitol din Cookbook.


aboutbox.contacts = \
	Pentru mai multe informa\u0163ii \u00een leg\u0103tur\u0103 cu proiectul ArgoUML:\n\
	\n\
	+ Vizita\u0163i site-ul nostru: http://argouml.tigris.org\n\
	\n\
	\n\
	Pentru mai multe informa\u0163ii despre cum pute\u0163i contribui la proiect:\n\
	\n\
	+ Vizita\u0163i "Developer Zone" pe site-ul web: \
	  http://argouml.tigris.org\n\
	\n\
	+ Citi\u0163i "Developer's Cookbook".\n\
	\n\
	+ Urm\u0103ri\u0163i discu\u0163iile de pe lista de email a dezvoltatorilor.

aboutbox.developed-by = ArgoUML a fost dezvoltat de urm\u0103torii:
aboutbox.project-leader = Lider de proiect:
aboutbox.module-owners = Coordonatorii modulelor (contacta\u0163i aceste persoane dac\u0103 \
	dori\u0163i s\u0103 contribui\u0163i):
aboutbox.contrib-developers-for-release = Au contribuit la dezvoltarea {0}:
aboutbox.past-developers = Au contribuit \u00een trecut la ArgoUML:

aboutbox.generated-version-header = \n--- Informa\u0163ii (generate automat) despre aceast\u0103 versiune: ---\n

aboutbox.legal = \
	Copyright (c) 1996-2006 The Regents of the University of California.\n\
	All Rights Reserved.  \
	Permission to use, copy, modify, and distribute this software and \
	its documentation without fee, and without a written agreement \
	is hereby granted, provided that the above copyright notice and \
	this paragraph appear in all copies.  \
	This software program and documentation are copyrighted by \
	The Regents of the University of California.  \
	The software program and documentation are supplied ''as is'', \
	without any accompanying services from The Regents.  \
	The Regents do not warrant that the operation of the program \
	will be uninterrupted or error-free.  \
	The end-user understands that the program was developed \
	for research purposes and is advised not to rely exclusively \
	on the program for any reason.\n\
	IN NO EVENT SHALL THE UNIVERSITY OFCALIFORNIA BE LIABLE \
	TO ANY PARTY FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, \
	OR CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS, \
	ARISING OUT OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, \
	EVEN IF THE UNIVERSITY OF CALIFORNIA HAS BEEN ADVISED \
	OF THE POSSIBILITY OF SUCHDAMAGE.  \
	THE UNIVERSITY OF CALIFORNIA SPECIFICALLY DISCLAIMS ANY WARRANTIES, \
	INCLUDING, BUT NOT LIMITED TO, \
	THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS \
	FOR A PARTICULAR PURPOSE.  \
	THE SOFTWAREPROVIDED HEREUNDER IS ON AN ''AS IS'' BASIS, \
	AND THE UNIVERSITY OF CALIFORNIA HAS NO OBLIGATIONS TO \
	PROVIDE MAINTENANCE, SUPPORT,UPDATES, ENHANCEMENTS, OR MODIFICATIONS.

aboutbox.thanks = \
	Dezvoltatorii ArgoUML doresc s\u0103 mul\u0163umeasc\u0103 \
	tuturor persoanelor care au dedicat timpul lor pre\u0163ios \
	dezvolt\u0103rii proiectelor de care ArgoUML depinde! \
	ArgoUML nu ar fi fost ceea ce este azi f\u0103r\u0103 ajutorul \
	vostru!\n

aboutbox.used-tools-header = \nFolose\u015fte urm\u0103toarele unelte:\n

aboutbox.tab.splash = Splash
aboutbox.tab.version = Versiune
aboutbox.tab.credits = Credit
aboutbox.tab.contacts = Contact
aboutbox.tab.bugreport = Raportare erori
aboutbox.tab.legal = Legal
